package day03;
/*
计算机中不同进制的使用说明


进制之间的转换
    二进制：0，1；满2进1；   以0b或者0B开头。
    十进制：0～9；满10进1；
    八进制：0～7；满8进1；   以数字0开头
    十六进制：0～9和A；满16进1；以0x或者0X开头表示。此处的A-F不区分大小写；



    二进制转十进制：

    二进制：0   0   0   0   1   1   1   0
    十进制：14
    注意；正数的原码，反码，补码都一样

    -14转化为二进制
    1   0   0   0   1   1   1   0   -14的原码
    1   1   1   1   0   0   0   1   -14的反码：除符号外，各各位取反
    1   1   1   1   0   0   1   0   -14的补码：反码+1
    计算机底层都以补码的方式来存储数据


    十进制转二进制：除以2取余数，倒过来。
 */


public class BinaryTest {
    public static void main(String[] args) {


    }
}
